{"./services\\sites-update\\site-update.html":{"title":"","content":"Обновление цен и наличия на сайте\nДля корректного обновления цен и наличия товаров на вашем сайте выполните следующие шаги.\n1. Настройка постоянной ссылки для выгрузки товаров\nСоздайте постоянную ссылку на файл в одном из следующих форматов: XLSX, XLS (кроме Excel'95), CSV, TXT, YML. При обращении по этой ссылке мы сможем получать актуальный список товаров, включая неактивные и отсутствующие в продаже. Данные для передачи:\nПоля для передачи данных о товаре Обязательные:\nID (уникальный идентификатор товара)\nНаименование\nОчень желательно:\nКод производителя\nШтрихкод\nСсылка на товар\nБренд\nНеобязательные:\nЦена\nСтатус\nКатегория\nи др.\nПример ссылки: http://www.mypc.by/export.csv\n2. Загрузка прайс-листов поставщиков\nНастройте автоматическую загрузку прайс-листов поставщиков по постоянным ссылкам (из почты, Google Документов, FTP и т.д.) через вкладку «Настройка» — раздел «Настройка прайсов».\nИли на вкладке «Обработка прайсов» - загрузить нужные прайс-листы поставщиков.\n3. Настройка правил ценообразования\nНа вкладке «Настройка» — раздел «Расценки» настройте правила формирования цен для пересчета по загруженным прайс-листам.\n4. Сопоставление товаров\nПосле загрузки прайс-листов через раздел «Обработка прайсов» сопоставьте товары по каждому поставщику. Товары, которые не были автоматически найдены, необходимо сопоставить вручную с помощью поиска по модели.\n5. Обновление данных\nСформируйте обновление данных по загруженным прайс-листам, галочками выделяете нужные прайсы и нажимаете «Запустить обновление» после чего информация обновится в\nAPI\nи на вкладке прайс. Система автоматически запускает скрипт для обновления цен и наличия на сайте по ID товара.\nПримечание\nГалочку «Остатки» нужно отмечать в том случае, если необходимо выставить приоритет по прайсу (т.е при пересечении позиций, цены в первую очередь, будут выставляться именно из него).\nОбычно отмечается, если это складские остатки.\n6. Интеграция с сайтом через API\nДля интеграции сайта используйте наше\nAPI\n(формат JSON ). Документация доступна по ссылке:\nhttps://help.zoomos.by/api/\n7. Использование собственной базы товаров\nЕсли вы используете собственную базу товаров, отметьте файл с выгрузкой «База».\nБаза\nПри необходимости настройте приоритеты для остатков и цен, основываясь на выбранных источниках прайс-листов.\n8. Дополнительные настройки\nЕсли необходимо использовать цены конкурентов при формировании розничных цен, в выпадающем меню «Брать мин. цену с» выберите торговую площадку:\nПосле этого можно проверить итоговые цены на странице «Прайс» (на данной странице проверяйте столбец с «Итоговая цена», именно она уйдет на сайт).\nApplication Programming Interface","keywords":[]},"./services\\sites-update\\onliner-update.html":{"title":"Обновление торговых площадок","content":"Существует два варианта обновления торговых площадок:\nОбновление по прайс-листам поставщиков\nАвтоматическое обновление по ссылке с сайта\nОбновление по прайс-листам поставщиков\nДля обновления цен и статусов товаров по прайсам поставщиков выполните следующие шаги:\n1. Зайдите на страницу торговой площадки Onliner.by.\n2. Загрузите прайс (прайс-лист поставщика или скачанный с площадки).\n3. Отметьте столбцы из прайса, где находятся производитель, модель, цена, статус товаров и др.\n4. Нажмите «Продолжить» и дождитесь завершения процесса (100%).\n5. После завершения нажмите «Открыть» справа от прайса.\n6. Проверьте ненайденные товары, которые не были автоматически сопоставлены, и сопоставьте их вручную.\n7. Отредактируйте название товара в первом столбце, чтобы программа могла подсветить нужную модель. Если модель не найдена, проверьте ее на сайте площадки и вставьте ссылку на товар вручную.\n8. Перейдите в «Настройки - Расценка » и настройте правила ценообразования.\n9. Вернитесь на страницу площадки, выберите прайсы для обновления и нажмите «Запустить обновление».\n«Запустить обновление»\nВажно\nЛюбые изменения в правилах расценки, на вкладке гарантия применяются только после формирования обновления!\n10. После завершения процесса перейдите на страницу «Прайс» и проверьте колонку «Итоговая цена» — она уйдет на площадку.\n11. Сохраните файл обновления по завершению процесса формирования.\n12. Загрузите файл в личный кабинет торговой площадки (для Onliner.by можно настроить автоматическую отправку).\nАвтоматическое обновление по ссылке\nДля автоматического обновления товаров на площадке:\n1. Предоставьте постоянную ссылку на выгрузку ваших товаров (с наименованием, id, ценой, статусом и др.).\n2. Мы настраиваем автоматическую выгрузку товаров на торговые площадки.\n3. Укажите ссылку в личном кабинете площадки для обновления.\n4. Настройте интервал обновления (любой удобный).\nОписание столбцов:\nПроизводитель — столбец с производителем устройства.\nМодель — столбец с моделью устройства.\nКод производителя — артикул производителя (если нет, пропускаем).\nЦена — столбец с ценой, валюта указана в прайсе (можно настроить курс пересчета).\nСтатус — столбец с наличием товара («под заказ», «в наличии», «нет в наличии»).\nКоличество — остатки товара в числовом выражении.\nID — код товара у поставщика.\nНастройка выгрузки для Onliner\nКлючи:\nOnliner Client ID\nOnliner Client Secret\nПолучить их можно в B2B кабинете Onliner на вкладке импорт/экспорт.\nСоздайте приложение \"onliner-b2b-api\"\nИспользуйте сгенерированные ключи\n2. Заполните информацию о доставке и описание в настройках (раздел «блок онлайнера»).\n3. Укажите недостающую информацию во вкладке «Гарантия» (обязательно для обновлений).\n4. Проверьте правильность формирования данных на вкладке прайс (цены, статусы).\n5. Сделайте бэкап в B2B кабинете перед включением автоматической отправки, чтобы иметь возможность вернуть данные в случае ошибки.\n6. После всех проверок включите автоматическую отправку, переключив настройку «Не отправлять прайслист на Onliner через API» в положение «нет».\nВажно\nВсе изменения в настройках необходимо сохранить.\nApplication Programming Interface","keywords":[]},"./services\\sites-update\\price-handler\\price-handler.html":{"title":"","content":"Инструкция по загрузке прайс-листов поставщиков\nЧтобы загрузить прайс-листы поставщиков и обновить цены и наличие товаров в системе, выполните следующие шаги:\n1 Откройте страницу Работа с прайсами - Обработка прайсов, Onliner.by, (Shop.by, Yandex, Hotline и др.).\nОбработка прайсов\n2 Нажмите кнопку для загрузки прайса.\n3 В появившемся окне выберите нужные столбцы из выпадающего списка, где указаны бренд, модель, цена и другие данные о товаре.\nСопоставление столбцов\nСовет №1\nДля сохранения сопоставленных столбцов, загружайте прайс с выбранным именем поставщика.\nСовет №2\nМаксимально полно настраивайте загрузку данных.\n4 Нажмите Продолжить и дождитесь обработки прайс-листа.\n5 После обработки появится список загруженных прайс-листов. Справа от каждого прайса нажмите кнопку Открыть.\n6 Вы увидите товары, которые не были автоматически сопоставлены с моделями вашего сайта или торговой площадки. Эти товары нужно связать вручную.\n7 Для ручного сопоставления выберите первый товар и начните вводить его название. Программа предложит похожие модели из базы данных вашего магазина. Если модель найдена, просто кликните на нее, и товар будет сопоставлен. Подробнее про сопоставление.\nВозможности системы\nПоддерживаемые форматы файлов: XLSX, XLS (кроме Excel'95), CSV, TXT, YML\nОдновременная загрузка нескольких файлов: удерживайте клавишу Ctrl для выбора нескольких файлов.\nПоиск несопоставленных товаров: кнопка «Найти» рядом с позициями, для которых нет соответствий.\nОбозначение новых товаров: система отмечает новые товары и модели значком «New» для быстрого добавления соответствий.\nАвтоматическая загрузка прайс-листов: настройка загрузки файлов по постоянной ссылке, FTP, Google Docs, Dropbox или из почтового ящика.\nОбработка каждой вкладки прайса: если в разных вкладках указаны разные столбцы данных.\nРабота с различными валютами: можно отметить столбец с валютой, в котором указано название валюты.\nЧерный список\nДля исключения товаров из обновления:\nОткройте прайс.\nВыделите нужные позиции (удерживайте Ctrl для выбора нескольких или Shift для выделения списка подряд).\nНажмите на кнопку В черный список между блоками «найденные» и «не найдено», чтобы исключить позиции.\nЧерный список\nПримечание\nв настоящий момент доступно только в старом дизайне сайта: https:// export.zoomos.by/\nНастройка цен\nРозница: цены берутся напрямую из прайса без перерасчета.\nОпт: цены рассчитываются по правилам на странице Настройки → Расценка.\nОписание столбцов прайс-листа\nПроизводитель: столбец с указанием бренда устройства.\nМодель: столбец с моделью устройства.\nКод производителя: артикул товара от производителя. Если его нет, поле можно не отмечать.\nЦена: столбец с ценой товара. Валюта указывается из прайса, в дальнейшем возможно автоматическое преобразование в нужную валюту.\nСтатус: указывает наличие товара. Если все товары в наличии, поле можно не заполнять.\nКоличество: указывает количество товара на складе.\nПримечание\nКоличество только числовое значение.\nID: код товара у поставщика, обычно числовой.\nДополнительные возможности\nВо вкладке Гарантия можно отключить выгрузку отдельных категорий или брендов на сайт или торговую площадку.\nТест H6","keywords":[]},"./services\\sites-update\\price-handler\\price-handler-auto.html":{"title":"Автоматическая загрузка прайс-листов","content":"Настройка прайс-листов из почтового ящика\n1. Переходим во вкладку \"Настройки\" -> \"Настройка прайсов\"\n2. Добавляем новую строку\n3. Заполнение адреса ссылки\nФормула:\nmail://info@gmail.com:12345/price@mail.ru/ACC Distribution/АСС\nПояснение:\ninfo@gmail.com - адрес вашей почты\n12345 - пароль от почты\nprice@mail.ru - адрес отправителя (можно не заполнять)\nACC Distribution - тема письма (можно указать только часть названия, если оно постоянно меняется)\nАСС - название вложенного прайса (указывать без даты)\nПример формулы без заполнения адреса отправителя:\nmail://info@gmail.com:12345/ /ACC Distribution/АСС\nЕсли прайс указывается с датой, то пишем только первую часть названия, без цифр:\nПример: price_10_08_16.xls -> price\nФормула:\nmail://info@gmail.com:12345/price@mail.ru/ACC Distribution/price\n4. Заполнение необходимых столбцов\nЗаполняем полученную ссылку и указываем необходимые столбцы. Для одного прайса можно задать сразу несколько \"целей\" загрузки в разные вкладки в системе.\nПример письма в почтовом ящике\nВарианты итоговой ссылки\nmail://info@gmail.com:12345/noreply@nereida.by/Прайс-лист (Нереида)/Nereida price-list\nmail://info@gmail.com:12345/@nereida.by/прайс/price\n5. Завершение настройки\nКогда все нужные столбцы заполнены, просто закрываем окно.\n6. Проверка правильности настройки прайса\nНажимаем \"Запустить\" напротив нашей ссылки:\n7. Проверка загруженного прайса\nПрайс загрузится в указанную вкладку, где его можно проверить.\nНастройки почты\nНеобходимо убедиться, что в настройках почты разрешен доступ по протоколу IMAP:\nНазвание таба 1\nНазвание таба 2\nВключение двухэтапной аутентификации:\nДобавление пароля приложения:\nИспользование пароля при настройке загрузки прайса.\nТакже необходимо разрешить доступ к почте небезопасным приложениям:\nДополнительные настройки для почты tut.by, Яндекс\nДля почты tut.by и Яндекс необходимо дополнительно указать IMAP сервер: imap.yandex.ru\nВидео инструкция\nНастройка прайсов из Dropbox 1. Переходим во вкладку \"Настройки\" -> \"Настройка прайсов\" 2. Добавляем новую строку и прописываем нужную ссылку/отмечаем столбцы Форматирование ссылки для Dropbox\nПереходим на прайс по ссылке Dropbox (например, прайс Gardena)\nПример ссылки:\nhttps://www.dropbox.com/sh/thtu4k8k0gbyulh/AAC8AVfBHEdlB3yL8TrJiUmMa/Gardena.xls?dl=0\nПреобразуем в:\nhttps://www.dropbox.com/sh/thtu4k8k0gbyulh/AAC8AVfBHEdlB3yL8TrJiUmMa/Gardena.xls?dl=1&pv=1\nЗамена:\ndl=0 на dl=1&pv=1 (в конце ссылки)\n3. Применение полученной ссылки\nГотово, полученную ссылку можно использовать.\nНастройка прайсов из Google Docs Пример ссылки\nhttps://docs.google.com/spreadsheets/d/1MV6qMbxkV5Gw-S7nV13HrOSvJq41xkMgSCITXQshnKQ/pub?output=html\nФормула для скачивания в формате Excel\nНеобходимо заменить последнюю часть после / на /export?exportFormat=xlsx.\nПример:\nhttps://docs.google.com/spreadsheets/d/1MV6qMbxkV5Gw-S7nV13HrOSvJq41xkMgSCITXQshnKQ/pub?output=html\nПреобразуем в:\nhttps://docs.google.com/spreadsheets/d/1MV6qMbxkV5Gw-S7nV13HrOSvJq41xkMgSCITXQshnKQ/export?exportFormat=xlsx\nФормула для загрузки вкладки в формате CSV\nЗаменяем /edit#gid=1615075392 на /export?exportFormat=csv&gid=1053932382:\nПример:\nhttps://docs.google.com/spreadsheets/d/1knVFWPz3a6_aH7nvtsaeSka2nH0yAriGvZAEsJ6o-gE/edit#gid=1615075392\nПреобразуем в:\nhttps://docs.google.com/spreadsheets/d/1knVFWPz3a6_aH7nvtsaeSka2nH0yAriGvZAEsJ6o-gE/export?exportFormat=csv&gid=1053932382\nПримечание:\nВкладка всегда указывается под номером 1.\nПрайс по ссылке Google Docs можно настроить только если он \"опубликован\":\nАвтоматическая загрузка по расписанию\nАвтоматическую загрузку прайс-листов можно настроить по расписанию, в удобное для вас время.\nНастройка прайсов с FTP 1. Переходим во вкладку \"Настройки\" -> \"Настройка прайсов\" 2. Добавляем новую строку 3. Заполнение адреса ссылки\nФормула:\nftp://zoomos:12345@ftp.site.by/Zoomos.csv\nПояснение:\nftp.site.by - адрес FTP\n12345 - пароль\nzoomos - логин\nZoomos.csv - название файла","keywords":[]},"./services\\sites-update\\pricing\\quotation.html":{"title":"","content":"","keywords":[]},"./services\\sites-update\\pricing\\priorities.html":{"title":"","content":"","keywords":[]},"./services\\sites-update\\pricing\\delivery.html":{"title":"","content":"","keywords":[]},"./services\\mapping\\mapping-instruction-file.html":{"title":"","content":"","keywords":[]},"./services\\mapping\\mapping-instruction.html":{"title":"","content":"","keywords":[]},"./services\\product-descriptions.html":{"title":"Описания товаров","content":"В каталоге Zoomos насчитывается более 1 млн. готовых описаний товаров в различных категориях, примерно 500 товаров добавляется ежедневно. Все они представлены с огромным набором технических параметров, фотографиями.\nТекстовые описания выполнены на основе базовых описаний производителей и расширены описаниями с товарных порталов.\nВ каком виде предоставляются описания\nКаждое описание разбито по атрибутам, есть фотографии (от 1 до 10 в зависимости от категории и модели)\nНиже идет html описание, а также к некоторым моделям прилагается маркетинговое описание (при необходимости его можно добавить ко всем необходимым)\nОписания представлены в виде технических характеристик товара и все подогнаны под один набор атрибутов для создания фильтров для поиска на сайте\nКак построен процесс работы\nЧтобы наполнить интернет-магазин товарами с помощью Zoomos, от вас понадобится лишь список товаров для заполнения или прайс-лист поставщика, с которым вы работаете.\nПо мере готовности описаний - готовые карточки товаров передаются через\nAPI\n, вам остается только загрузить их к себе на сайт. Либо в файле импорта, который будет оптимальным для его CMS (это оговаривается заранее).\nВариант добавления товаров в WinShop:\nСкачать архив по ссылке, которую мы предоставили.\nРазархивировать архив в отдельную папку\nВ архиве будет 2 папки: x150 и x400 и картинки в оригинальном размере. Оригинальные картинки в Winshop не нужно копировать. Также в архиве будет находиться файл импорта в формате.txt, данный файл импорта нужно будет проимпортировать в Winshop.\nСодержимое папок x150 и x400 необходимо скопировать в папку с WinShop на диск С (или другой диск), где у Вас установлена сама программа.\nПуть выглядит следующим образом:\nC:\\Program Files (x86)\\Winshop\\Data\\Название магазина\\Images\\Img\nПримечание\nПапку «Img» (без кавычек) необходимо обязательно создать.\nОткрываем программу WinShop. Вверху экрана слева щелкаем: Магазин - Импорт товаров.\nВыбираем.txt файл, который находится в архиве с картинками и переходим к следующему шагу.\nВ открывшемся окне сверху проверяем, чтобы было выставлено «Обновление по полю: Код» и галочка «Проверять наличие иконок и картинок». Желательно добавлять новые товары в отдельно созданную папку, например «Новые». Папку можно сделать на сайте неактивной. Делается это для того, чтобы в случае, если импорт произойдет неправильно, товары из данной папки можно было бы быстро удалить.\nПосле отмечаем столбцы (столбцы могут меняться, поэтому самой первой строкой в списке товаров сделана подпись столбцов, можете с ней сверяться):\nА - код\nF - краткое название\nG - Полное название\nP - статус\nS - краткое описание\nT - полное описание\nW - Иконка\nX - картинка\n- После удаляем первую строку с подписями столбцов и жмем кнопку «Импорт». Новые товары добавились.\n- Вам остается далее только раскидать товары по нужным Вам категориям.\nApplication Programming Interface","keywords":[]}}